<?php

return [
    200 => [
        'short' => 'درخواست موفق.',
        'large' => 'درخواست موفقیت آمیز بود.'
    ],
    201 => [
        'short' => 'ایجاد شد.',
        'large' => 'درخواست ایجاد با موفقیت انجام شد.',
    ],
    202 => [
        'short' => 'قبول شد.',
        'large' => 'درخواست با موفقیت قبول شد.',
    ],
    400 => [
        'short' => 'مشکل سمت کاربر.',
        'large' => 'اجرای درخواست به علت وجود مشکل در درخواست کاربر لغو شد.',
    ],
    401 => [
        'short' => 'مشکل در احراز هویت.',
        'large' => 'اجرای درخواست به علت عدم احراز هویت لغو شد.',
    ],
    403 => [
        'short' => 'مشکل در سطح دسترسی.',
        'large' => 'اجرای درخواست به علت عدم سطح دسترسی مناسب لغو شد.',
    ],
    404 => [
        'short' => 'پیدا نشد.',
        'large' => 'اجرای درخواست به علت پیدا نشدن منبع مناسب لغو شد.',
    ],
    422 => [
        'short' => 'مشکل درخواست.',
        'large' => 'اجرای درخواست به علت مشکل در اطلاعات ارسالی لغو شد.',
    ],
    429 => [
        'short' => 'درخواست بیش از حد مجاز.',
        'large' => 'اجرای درخواست به علت درخواست بیش از حد مجاز لغو شد.',
    ],
    500 => [
        'short' => 'مشکل سرور.',
        'large' => 'اجرای درخواست به علت وقوع مشکل سروری لغو شد.',
    ]
];